# GetModelName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkLoadResult..::..GetModelName Method
LinkLoadResult Class See Also
---
Gets the name of the model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ModelPath GetModelName()
```

Visual Basic
---
```text
Public Function GetModelName As ModelPath
```

Visual C++
---
```text
public:
ModelPath^ GetModelName()
```

# See Also
LinkLoadResult Class
Autodesk.Revit.DB Namespace